Revit 2027 API
ExternalDefinition.Description Property
 The description of the parameter. The description will be used as tooltip in the Revit UI including in the properties palette.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual string Description { get; }
Public Overridable ReadOnly Property Description As String
	Get
public:
virtual property String^ Description {
	String^ get ();
}
abstract Description : string with get
override Description : string with get
Property Value
String
See Also
Reference
ExternalDefinition Class
Autodesk.Revit.DB Namespace